# SurfaceAlbedo Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedGlazing..::..SurfaceAlbedo Property
AdvancedGlazing Class See Also
---
The property labeled "Color" from the "AdvancedGlazing" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public static string SurfaceAlbedo { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SurfaceAlbedo As String
	Get
```

Visual C++
---
```text
public:
static property String^ SurfaceAlbedo {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
# See Also
AdvancedGlazing Class
Autodesk.Revit.DB.Visual Namespace